#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
// ++ Меляков Д. 12.12.26 
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
// -- Меляков Д. 12.02.26 
	
КонецПроцедуры  

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
// ++ Меляков Д. 12.02.26 
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("%1(на основ. %2)", Данные.Наименование, Данные.ДействуетНаОсновании); 
// -- Меляков Д.12.02.26 
	
КонецПроцедуры

#КонецОбласти